7767517
19 19
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Convolution              convrelu_0               1 1 in0 2 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 9=1
Convolution              convrelu_1               1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              convrelu_2               1 1 3 4 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              convrelu_3               1 1 4 5 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_4               1 1 in1 6 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 9=1
Convolution              convrelu_5               1 1 6 7 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              convrelu_6               1 1 7 8 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              convrelu_7               1 1 8 9 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_0                    2 1 5 9 10 0=0
Convolution              convrelu_8               1 1 10 11 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Convolution              convrelu_9               1 1 11 12 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Pooling                  gap_0                    1 1 12 13 0=1 4=1
Reshape                  reshape_26               1 1 13 14 0=1 1=1 2=-1
Flatten                  flatten_27               1 1 14 15
InnerProduct             fcrelu_0                 1 1 15 16 0=256 1=1 2=16384 9=1
InnerProduct             fcrelu_1                 1 1 16 17 0=128 1=1 2=32768 9=1
InnerProduct             linear_13                1 1 17 out0 0=6 1=1 2=768
